RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.c
    if((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) ||
       (CY_CAPSENSE_CSD_SS_DIS == context->ptrCommonConfig->csdAutotuneEn))
    {
        crcDataVal.fingerThVal       = ptrWdCxt->fingerTh;
        crcDataVal.proxThVal         = ptrWdCxt->proxTh;
        crcDataVal.noiseThVal        = ptrWdCxt->noiseTh;
        crcDataVal.nNoiseThVal       = ptrWdCxt->nNoiseTh;
        crcDataVal.hysteresisVal     = ptrWdCxt->hysteresis;
    }

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        crcDataVal.resolutionVal     = ptrWdCxt->resolution;
        crcDataVal.idacModVal[0u]    = ptrWdCxt->idacMod[0u];
        crcDataVal.idacModVal[1u]    = ptrWdCxt->idacMod[1u];
        crcDataVal.idacModVal[2u]    = ptrWdCxt->idacMod[2u];
        crcDataVal.idacGainIndexVal  = ptrWdCxt->idacGainIndex;
        crcDataVal.rowIdacModVal[0u] = ptrWdCxt->rowIdacMod[0u];
        crcDataVal.rowIdacModVal[1u] = ptrWdCxt->rowIdacMod[1u];
        crcDataVal.rowIdacModVal[2u] = ptrWdCxt->rowIdacMod[2u];
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        crcDataVal.resolutionVal   = ptrWdCxt->numSubConversions;
        crcDataVal.cdacRef         = ptrWdCxt->cdacRef;
        crcDataVal.rowCdacRef      = ptrWdCxt->rowCdacRef;
        crcDataVal.cdacCompDivider = ptrWdCxt->cdacCompDivider;
        crcDataVal.cicRate         = ptrWdCxt->cicRate;
        crcDataVal.lfsrBits        = ptrWdCxt->lfsrBits;
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

    crcValue = Cy_CapSense_GetCRC((uint8_t *)(&crcDataVal), sizeof(crcDataVal));

    return (crcValue);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetParam
****************************************************************************//**
*
* Gets a value of the specified parameter from the cy_capsense_tuner structure.
*
* This function gets the value of the specified parameter by the paramId
* argument. The paramId for each register of cy_capsense_tuner is available
* in the cycfg_capsense.h file as CY_CAPSENSE_<ParameterName>_PARAM_ID.
* The paramId is a special enumerated value generated by the CAPSENSE&trade;
* Configurator. The format of paramId is as follows:
* 1. [ byte 3 byte 2 byte 1 byte 0 ]
* 2. [ RRRRRUTT IIIIIIII MMMMMMMM LLLLLLLL ]
* 3. U - indicates if the parameter affects the RAM Widget Object CRC.
* 4. T - encodes the parameter type:
*    * 01b: uint8_t
*    * 10b: uint16_t
*    * 11b: uint32_t
* 5. I - specifies that the widgetId parameter belongs to.
* 6. M,L - the parameter offset MSB and LSB accordingly in cy_capsense_tuner.
* 7. R - reserved
*
* \param paramId
* Specifies the ID of parameter to get its value.
* A macro for the parameter ID can be found in the cycfg_capsense.h file
* defined as CY_CAPSENSE_<ParameterName>_PARAM_ID.
*
* \param value
* The pointer to a variable to be updated with the obtained value.
*
* \param ptrTuner
* The pointer to the cy_capsense_tuner variable of cy_stc_capsense_tuner_t.
* The cy_capsense_tuner is declared in CAPSENSE&trade; Configurator generated files:
* * cycfg_capsense.c/h
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation. If CY_CAPSENSE_STATUS_SUCCESS is not received,
* either paramId is invalid or ptrTuner is null.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GetParam(
                uint32_t paramId,
                uint32_t * value,
                const void * ptrTuner,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    uint32_t paramType;
    uint32_t paramOffset;

    const uint8_t * bytePtr;
    const uint16_t * halfWordPtr;
    const uint32_t * wordPtr;

    (void)context;
    if ((value != NULL) && (ptrTuner != NULL))
    {
        /* Check parameter type, offset alignment and read data */
        paramType = (paramId & CY_CAPSENSE_PARAM_TYPE_MASK) >> CY_CAPSENSE_PARAM_TYPE_OFFSET;
        paramOffset = (uint16_t)(paramId);
        switch (paramType)
        {
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT32:
                if (0u == (paramOffset & CY_CAPSENSE_UINT32_ALIGN_MASK))
                {
                    paramOffset >>= 2u;
                    wordPtr = (const uint32_t *)ptrTuner;
                    *value = (uint32_t)wordPtr[paramOffset];
                    capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                }
                break;
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT16:
                if (0u == (paramOffset & CY_CAPSENSE_UINT16_ALIGN_MASK))
                {
                    paramOffset >>= 1u;
                    halfWordPtr = (const uint16_t *)ptrTuner;
                    *value = (uint32_t)halfWordPtr[paramOffset];
                    capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                }
                break;
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT8:
                bytePtr = (const uint8_t *)ptrTuner;
                *value = (uint32_t)bytePtr[paramOffset];
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
               break;
            default:
                /* No action on other parameter types */
                break;
        }
    }
    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetParam
****************************************************************************//**
*
* Sets a new value for the specified parameter in cy_capsense_tuner structure.
*
* This function sets the value of the specified parameter by the paramId
* argument. The paramId for each register of cy_capsense_tuner is available
* in the cycfg_capsense.h file as CY_CAPSENSE_<ParameterName>_PARAM_ID.
* The paramId is a special enumerated value generated by the CAPSENSE&trade;
* Configurator. The format of paramId is as follows:
* 1. [ byte 3 byte 2 byte 1 byte 0 ]
* 2. [ RRRRRUTT IIIIIIII MMMMMMMM LLLLLLLL ]
* 3. U - indicates if the parameter affects the RAM Widget Object CRC.
* 4. T - encodes the parameter type:
*    * 01b: uint8_t
*    * 10b: uint16_t
*    * 11b: uint32_t
* 5. I - specifies that the widgetId parameter belongs to
* 6. M,L - the parameter offset MSB and LSB accordingly in cy_capsense_tuner.
* 7. R - reserved
*
* This function writes specified value into the desired register without
* other registers update. It is application layer responsibility to keep all
* the data structure registers aligned. Repeated call of
* Cy_CapSense_Enable() function helps aligning dependent register values.
*
* This function updates also the widget CRC field if Built-in Self-test
* is enabled and paramId requires that.
*
* \param paramId
* Specifies the ID of parameter to set its value.
* A macro for the parameter ID can be found in the cycfg_capsense.h file
* defined as CY_CAPSENSE_<ParameterName>_PARAM_ID.
*
* \param value
* Specifies the new parameter's value.
*
* \param ptrTuner
* The pointer to the cy_capsense_tuner variable of cy_stc_capsense_tuner_t.
* The cy_capsense_tuner is declared in CAPSENSE&trade; Configurator generated files:
* * cycfg_capsense.c/h
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation. If CY_CAPSENSE_STATUS_SUCCESS is not received,
* the parameter was not updated with the new value, either paramId is invalid
* or ptrTuner is null.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SetParam(
                uint32_t paramId,
                uint32_t value,
                void * ptrTuner,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t paramOffset;
    uint32_t paramType;
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
        uint32_t paramCrc;
        uint32_t paramWidget;
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

