RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.c
    uint8_t * bytePtr;
    uint16_t * halfWordPtr;
    uint32_t * wordPtr;

    if ((context == NULL) || (ptrTuner == NULL))
    {
        capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    /* Parse paramId */
    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        paramOffset = (uint16_t)(paramId);
        paramType = (paramId & CY_CAPSENSE_PARAM_TYPE_MASK) >> CY_CAPSENSE_PARAM_TYPE_OFFSET;

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
            paramCrc = (paramId & CY_CAPSENSE_PARAM_CRC_MASK) >> CY_CAPSENSE_PARAM_CRC_OFFSET;
            paramWidget = (paramId & CY_CAPSENSE_PARAM_WIDGET_MASK) >> CY_CAPSENSE_PARAM_WIDGET_OFFSET;
            if ((paramWidget > context->ptrCommonConfig->numWd) &&
                (0u != paramCrc))
            {
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
            }
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */
    }

    /* Check parameter type, offset alignment, write the specified parameter */
    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        switch (paramType)
        {
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT32:
                if (0u == (paramOffset & CY_CAPSENSE_UINT32_ALIGN_MASK))
                {
                    paramOffset >>= 2u;
                    wordPtr = (uint32_t *)ptrTuner;
                    wordPtr[paramOffset] = value;
                }
                break;
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT16:
                if (0u == (paramOffset & CY_CAPSENSE_UINT16_ALIGN_MASK))
                {
                    paramOffset >>= 1u;
                    halfWordPtr = (uint16_t *)ptrTuner;
                    halfWordPtr[paramOffset] = (uint16_t)value;
                }
                break;
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT8:
               bytePtr = (uint8_t *)ptrTuner;
               bytePtr[paramOffset] = (uint8_t)value;
               break;
            default:
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }
    }

    /* Update widget CRC if needed */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
        if ((CY_CAPSENSE_STATUS_SUCCESS == capStatus) &&
            (0u != paramCrc))
        {
            Cy_CapSense_UpdateCrcWidget(paramWidget, context);
        }
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

    return capStatus;
}


#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3)) */


/* [] END OF FILE */
